zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32BG29/Include/efr32bg29_usart.h
/* Bit fields for USART TRIGCTRL */
#define _USART_TRIGCTRL_RESETVALUE              0x00000000UL                             /**< Default value for USART_TRIGCTRL            */
#define _USART_TRIGCTRL_MASK                    0x00001FF0UL                             /**< Mask for USART_TRIGCTRL                     */
#define USART_TRIGCTRL_RXTEN                    (0x1UL << 4)                             /**< Receive Trigger Enable                      */
#define _USART_TRIGCTRL_RXTEN_SHIFT             4                                        /**< Shift value for USART_RXTEN                 */
#define _USART_TRIGCTRL_RXTEN_MASK              0x10UL                                   /**< Bit mask for USART_RXTEN                    */
#define _USART_TRIGCTRL_RXTEN_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_RXTEN_DEFAULT            (_USART_TRIGCTRL_RXTEN_DEFAULT << 4)     /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_TXTEN                    (0x1UL << 5)                             /**< Transmit Trigger Enable                     */
#define _USART_TRIGCTRL_TXTEN_SHIFT             5                                        /**< Shift value for USART_TXTEN                 */
#define _USART_TRIGCTRL_TXTEN_MASK              0x20UL                                   /**< Bit mask for USART_TXTEN                    */
#define _USART_TRIGCTRL_TXTEN_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_TXTEN_DEFAULT            (_USART_TRIGCTRL_TXTEN_DEFAULT << 5)     /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_AUTOTXTEN                (0x1UL << 6)                             /**< AUTOTX Trigger Enable                       */
#define _USART_TRIGCTRL_AUTOTXTEN_SHIFT         6                                        /**< Shift value for USART_AUTOTXTEN             */
#define _USART_TRIGCTRL_AUTOTXTEN_MASK          0x40UL                                   /**< Bit mask for USART_AUTOTXTEN                */
#define _USART_TRIGCTRL_AUTOTXTEN_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_AUTOTXTEN_DEFAULT        (_USART_TRIGCTRL_AUTOTXTEN_DEFAULT << 6) /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_TXARX0EN                 (0x1UL << 7)                             /**< Enable Transmit Trigger after RX End of     */
#define _USART_TRIGCTRL_TXARX0EN_SHIFT          7                                        /**< Shift value for USART_TXARX0EN              */
#define _USART_TRIGCTRL_TXARX0EN_MASK           0x80UL                                   /**< Bit mask for USART_TXARX0EN                 */
#define _USART_TRIGCTRL_TXARX0EN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_TXARX0EN_DEFAULT         (_USART_TRIGCTRL_TXARX0EN_DEFAULT << 7)  /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_TXARX1EN                 (0x1UL << 8)                             /**< Enable Transmit Trigger after RX End of     */
#define _USART_TRIGCTRL_TXARX1EN_SHIFT          8                                        /**< Shift value for USART_TXARX1EN              */
#define _USART_TRIGCTRL_TXARX1EN_MASK           0x100UL                                  /**< Bit mask for USART_TXARX1EN                 */
#define _USART_TRIGCTRL_TXARX1EN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_TXARX1EN_DEFAULT         (_USART_TRIGCTRL_TXARX1EN_DEFAULT << 8)  /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_TXARX2EN                 (0x1UL << 9)                             /**< Enable Transmit Trigger after RX End of     */
#define _USART_TRIGCTRL_TXARX2EN_SHIFT          9                                        /**< Shift value for USART_TXARX2EN              */
#define _USART_TRIGCTRL_TXARX2EN_MASK           0x200UL                                  /**< Bit mask for USART_TXARX2EN                 */
#define _USART_TRIGCTRL_TXARX2EN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_TXARX2EN_DEFAULT         (_USART_TRIGCTRL_TXARX2EN_DEFAULT << 9)  /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_RXATX0EN                 (0x1UL << 10)                            /**< Enable Receive Trigger after TX end of f    */
#define _USART_TRIGCTRL_RXATX0EN_SHIFT          10                                       /**< Shift value for USART_RXATX0EN              */
#define _USART_TRIGCTRL_RXATX0EN_MASK           0x400UL                                  /**< Bit mask for USART_RXATX0EN                 */
#define _USART_TRIGCTRL_RXATX0EN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_RXATX0EN_DEFAULT         (_USART_TRIGCTRL_RXATX0EN_DEFAULT << 10) /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_RXATX1EN                 (0x1UL << 11)                            /**< Enable Receive Trigger after TX end of f    */
#define _USART_TRIGCTRL_RXATX1EN_SHIFT          11                                       /**< Shift value for USART_RXATX1EN              */
#define _USART_TRIGCTRL_RXATX1EN_MASK           0x800UL                                  /**< Bit mask for USART_RXATX1EN                 */
#define _USART_TRIGCTRL_RXATX1EN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_RXATX1EN_DEFAULT         (_USART_TRIGCTRL_RXATX1EN_DEFAULT << 11) /**< Shifted mode DEFAULT for USART_TRIGCTRL     */
#define USART_TRIGCTRL_RXATX2EN                 (0x1UL << 12)                            /**< Enable Receive Trigger after TX end of f    */
#define _USART_TRIGCTRL_RXATX2EN_SHIFT          12                                       /**< Shift value for USART_RXATX2EN              */
#define _USART_TRIGCTRL_RXATX2EN_MASK           0x1000UL                                 /**< Bit mask for USART_RXATX2EN                 */
#define _USART_TRIGCTRL_RXATX2EN_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USART_TRIGCTRL             */
#define USART_TRIGCTRL_RXATX2EN_DEFAULT         (_USART_TRIGCTRL_RXATX2EN_DEFAULT << 12) /**< Shifted mode DEFAULT for USART_TRIGCTRL     */

/* Bit fields for USART CMD */
#define _USART_CMD_RESETVALUE                   0x00000000UL                            /**< Default value for USART_CMD                 */
#define _USART_CMD_MASK                         0x00000FFFUL                            /**< Mask for USART_CMD                          */
#define USART_CMD_RXEN                          (0x1UL << 0)                            /**< Receiver Enable                             */
#define _USART_CMD_RXEN_SHIFT                   0                                       /**< Shift value for USART_RXEN                  */
#define _USART_CMD_RXEN_MASK                    0x1UL                                   /**< Bit mask for USART_RXEN                     */
#define _USART_CMD_RXEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_RXEN_DEFAULT                  (_USART_CMD_RXEN_DEFAULT << 0)          /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_RXDIS                         (0x1UL << 1)                            /**< Receiver Disable                            */
#define _USART_CMD_RXDIS_SHIFT                  1                                       /**< Shift value for USART_RXDIS                 */
#define _USART_CMD_RXDIS_MASK                   0x2UL                                   /**< Bit mask for USART_RXDIS                    */
#define _USART_CMD_RXDIS_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_RXDIS_DEFAULT                 (_USART_CMD_RXDIS_DEFAULT << 1)         /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_TXEN                          (0x1UL << 2)                            /**< Transmitter Enable                          */
#define _USART_CMD_TXEN_SHIFT                   2                                       /**< Shift value for USART_TXEN                  */
#define _USART_CMD_TXEN_MASK                    0x4UL                                   /**< Bit mask for USART_TXEN                     */
#define _USART_CMD_TXEN_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_TXEN_DEFAULT                  (_USART_CMD_TXEN_DEFAULT << 2)          /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_TXDIS                         (0x1UL << 3)                            /**< Transmitter Disable                         */
#define _USART_CMD_TXDIS_SHIFT                  3                                       /**< Shift value for USART_TXDIS                 */
#define _USART_CMD_TXDIS_MASK                   0x8UL                                   /**< Bit mask for USART_TXDIS                    */
#define _USART_CMD_TXDIS_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_TXDIS_DEFAULT                 (_USART_CMD_TXDIS_DEFAULT << 3)         /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_MASTEREN                      (0x1UL << 4)                            /**< Main Mode Enable                            */
#define _USART_CMD_MASTEREN_SHIFT               4                                       /**< Shift value for USART_MASTEREN              */
#define _USART_CMD_MASTEREN_MASK                0x10UL                                  /**< Bit mask for USART_MASTEREN                 */
#define _USART_CMD_MASTEREN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_MASTEREN_DEFAULT              (_USART_CMD_MASTEREN_DEFAULT << 4)      /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_MASTERDIS                     (0x1UL << 5)                            /**< Main Mode Disable                           */
#define _USART_CMD_MASTERDIS_SHIFT              5                                       /**< Shift value for USART_MASTERDIS             */
#define _USART_CMD_MASTERDIS_MASK               0x20UL                                  /**< Bit mask for USART_MASTERDIS                */
#define _USART_CMD_MASTERDIS_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_MASTERDIS_DEFAULT             (_USART_CMD_MASTERDIS_DEFAULT << 5)     /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_RXBLOCKEN                     (0x1UL << 6)                            /**< Receiver Block Enable                       */
#define _USART_CMD_RXBLOCKEN_SHIFT              6                                       /**< Shift value for USART_RXBLOCKEN             */
#define _USART_CMD_RXBLOCKEN_MASK               0x40UL                                  /**< Bit mask for USART_RXBLOCKEN                */
#define _USART_CMD_RXBLOCKEN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_RXBLOCKEN_DEFAULT             (_USART_CMD_RXBLOCKEN_DEFAULT << 6)     /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_RXBLOCKDIS                    (0x1UL << 7)                            /**< Receiver Block Disable                      */
#define _USART_CMD_RXBLOCKDIS_SHIFT             7                                       /**< Shift value for USART_RXBLOCKDIS            */
#define _USART_CMD_RXBLOCKDIS_MASK              0x80UL                                  /**< Bit mask for USART_RXBLOCKDIS               */
#define _USART_CMD_RXBLOCKDIS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_RXBLOCKDIS_DEFAULT            (_USART_CMD_RXBLOCKDIS_DEFAULT << 7)    /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_TXTRIEN                       (0x1UL << 8)                            /**< Transmitter Tristate Enable                 */
#define _USART_CMD_TXTRIEN_SHIFT                8                                       /**< Shift value for USART_TXTRIEN               */
#define _USART_CMD_TXTRIEN_MASK                 0x100UL                                 /**< Bit mask for USART_TXTRIEN                  */
#define _USART_CMD_TXTRIEN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_TXTRIEN_DEFAULT               (_USART_CMD_TXTRIEN_DEFAULT << 8)       /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_TXTRIDIS                      (0x1UL << 9)                            /**< Transmitter Tristate Disable                */
#define _USART_CMD_TXTRIDIS_SHIFT               9                                       /**< Shift value for USART_TXTRIDIS              */
#define _USART_CMD_TXTRIDIS_MASK                0x200UL                                 /**< Bit mask for USART_TXTRIDIS                 */
#define _USART_CMD_TXTRIDIS_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_TXTRIDIS_DEFAULT              (_USART_CMD_TXTRIDIS_DEFAULT << 9)      /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_CLEARTX                       (0x1UL << 10)                           /**< Clear TX                                    */
#define _USART_CMD_CLEARTX_SHIFT                10                                      /**< Shift value for USART_CLEARTX               */
#define _USART_CMD_CLEARTX_MASK                 0x400UL                                 /**< Bit mask for USART_CLEARTX                  */
#define _USART_CMD_CLEARTX_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_CLEARTX_DEFAULT               (_USART_CMD_CLEARTX_DEFAULT << 10)      /**< Shifted mode DEFAULT for USART_CMD          */
#define USART_CMD_CLEARRX                       (0x1UL << 11)                           /**< Clear RX                                    */
#define _USART_CMD_CLEARRX_SHIFT                11                                      /**< Shift value for USART_CLEARRX               */
#define _USART_CMD_CLEARRX_MASK                 0x800UL                                 /**< Bit mask for USART_CLEARRX                  */
#define _USART_CMD_CLEARRX_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_CMD                  */
#define USART_CMD_CLEARRX_DEFAULT               (_USART_CMD_CLEARRX_DEFAULT << 11)      /**< Shifted mode DEFAULT for USART_CMD          */

